# YOLOv9n

# parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],
   [-1, 1, Conv, [16, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [32, 3, 2]],  # 2-P2/4
   [-1, 1, RepNCSPELAN4, [64, 32, 16, 1]],  # 3
   [-1, 1, Conv, [64, 3, 2]],  # 4-P3/8
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 5
   [-1, 1, Conv, [128, 3, 2]],  # 6-P4/16
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 7
   [-1, 1, Conv, [128, 3, 2]],  # 8-P5/32
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 9
  ]

# YOLOv9 head
head:
  [
   [-1, 1, SPPELAN, [128, 256]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 1]],  # 16 (P3/8-small)
   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P4
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 19 (P4/16-medium)
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 22 (P5/32-large)

   # routing
   [5, 1, CBLinear, [[64]]], # 23
   [7, 1, CBLinear, [[64, 128]]], # 24
   [9, 1, CBLinear, [[64, 128, 128]]], # 25

   [0, 1, Conv, [16, 3, 2]],  # 26-P1/2
   [-1, 1, Conv, [32, 3, 2]],  # 27-P2/4
   [-1, 1, RepNCSPELAN4, [64, 32, 16, 1]],  # 28
   [-1, 1, Conv, [64, 3, 2]],  # 29-P3/8
   [[23, 24, 25, -1], 1, CBFuse, [[0, 0, 0]]], # 30
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 31
   [-1, 1, Conv, [128, 3, 2]],  # 32-P4/16
   [[24, 25, -1], 1, CBFuse, [[1, 1]]], # 33
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 34
   [-1, 1, Conv, [128, 3, 2]],  # 35-P5/32
   [[25, -1], 1, CBFuse, [[2]]], # 36
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 37

   [[31, 34, 37, 16, 19, 22], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
